{
  "items": {
    "byId": {
      "review1": {
        "id": "review1",
        "author": "user1",
        "date": "2016-09-21T14:00",
        "title": "Lovely place! Totally worth visiting.",
        "body": [
          "Instrument cultivated alteration any favourable expression law far nor. Both new like tore but year. An from mean on with when sing pain. Oh to as principles devonshire companions unsatiable an delightful. The ourselves suffering the sincerity. Inhabit her manners adapted age certain. Debating offended at branched striking be subjects.",
          "Yourself required no at thoughts delicate landlord it be. Branched dashwood do is whatever it. Farther be chapter at visited married in it pressed. By distrusts procuring be oh frankness existence believing instantly if. Doubtful on an juvenile as of servants insisted. Judge why maids led sir whose guest drift her point. Him comparison especially friendship was who sufficient attachment favourable how. Luckily but minutes ask picture man perhaps are inhabit. How her good all sang more why."
        ],
        "thumbs": "up",
        "stars": 4,
        "comments": []
      },
      "review2": {
        "id": "review2",
        "author": "user2",
        "date": "2016-09-21T14:00",
        "title": "Lovely place! Totally worth visiting.",
        "body": [
          "Bringing unlocked me an striking ye perceive. Mr by wound hours oh happy. Me in resolution pianoforte continuing we. Most my no spot felt by no. He he in forfeited furniture sweetness he arranging. Me tedious so to behaved written account ferrars moments. Too objection for elsewhere her preferred allowance her. Marianne shutters mr steepest to me. Up mr ignorant produced distance although is sociable blessing. Ham whom call all lain like."
        ],
        "thumbs": "down",
        "stars": 2,
        "comments": ["comment1"]
      },
      "review3": {
        "id": "review3",
        "author": "user4",
        "date": "2016-09-21T14:00",
        "title": "Lovely place! Totally worth visiting.",
        "body": [
          "It as announcing it me stimulated frequently continuing. Least their she you now above going stand forth. He pretty future afraid should genius spirit on. Set property addition building put likewise get. Of will at sell well at as. Too want but tall nay like old. Removing yourself be in answered he. Consider occasion get improved him she eat. Letter by lively oh denote an."
        ],
        "thumbs": "up",
        "stars": 4,
        "comments": []
      },
      "review4": {
        "id": "review4",
        "author": "user5",
        "date": "2016-09-21T14:00",
        "title": "Lovely place! Totally worth visiting.",
        "body": [
          "Agreed joy vanity regret met may ladies oppose who. Mile fail as left as hard eyes. Meet made call in mean four year it to. Prospect so branched wondered sensible of up. For gay consisted resolving pronounce sportsman saw discovery not. Northward or household as conveying we earnestly believing. No in up contrasted discretion inhabiting excellence. Entreaties we collecting unpleasant at everything conviction."
        ],
        "thumbs": "down",
        "stars": 2,
        "comments": []
      }
    },
    "allIds": ["review1", "review2", "review3", "review4"]
  },
  "comments": {
    "byId": {
      "comment1": {
        "id": "comment1",
        "author": "user3",
        "date": "2016-09-21T15:00",
        "body": [
          "Boy favourable day can introduced sentiments entreaties. Noisier carried of in warrant because. So mr plate seems cause chief widen first. Two differed husbands met screened his. Bed was form wife out ask draw. Wholly coming at we no enable. Offending sir delivered questions now new met. Acceptance she interested new boisterous day discretion celebrated.",
          "In show dull give need so held. One order all scale sense her gay style wrote. Incommode our not one ourselves residence. Shall there whose those stand she end. So unaffected partiality indulgence dispatched to of celebrated remarkably. Unfeeling are had allowance own perceived abilities."
        ]
      }
    },
    "allIds": ["comment1"]
  },
  "users": {
    "byId": {
      "user1": {
        "id": "user1",
        "name": "Jesus Diaz",
        "picture": "https://randomuser.me/api/portraits/women/9.jpg"
      },
      "user2": {
        "id": "user2",
        "name": "Väinö Erkkila",
        "picture": "https://randomuser.me/api/portraits/men/93.jpg"
      },
      "user3": {
        "id": "user3",
        "name": "Lineia Da Cruz",
        "picture": "https://randomuser.me/api/portraits/women/45.jpg",
        "role": "Hotel Manager"
      },
      "user4": {
        "id": "user4",
        "name": "Kuzey Ağaoğlu",
        "picture": "https://randomuser.me/api/portraits/men/77.jpg"
      },
      "user5": {
        "id": "user5",
        "name": "Catherine Richards",
        "picture": "https://randomuser.me/api/portraits/women/28.jpg"
      },
      "user6": {
        "id": "user6",
        "name": "Ava George",
        "picture": "https://randomuser.me/api/portraits/women/2.jpg"
      }
    },
    "allIds": ["user1", "user2", "user3", "user4", "user5", "user6"]
  }
}
